Revit 2024 API
FabricationPart.HasNoConnections Method
 Checks to see if all the fabrication part's connectors are open.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool HasNoConnections()
Visual Basic
Public Function HasNoConnections As Boolean
Visual C++
public:
bool HasNoConnections()
Return Value
 Returns true if the part has zero connections.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace